Revit 2024 API
ExportLayerInfo.GetLayerModifiers Method
 Gets all the project layer modifiers from the layer info.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<LayerModifier> GetLayerModifiers()
Visual Basic
Public Function GetLayerModifiers As IList(Of LayerModifier)
Visual C++
public:
IList<LayerModifier^>^ GetLayerModifiers()
Return Value
 The project layer modifier array.
See Also
ExportLayerInfo Class
Autodesk.Revit.DB Namespace